//
// Created by 35540 on 2026/4/8.
//

#ifndef YMODEMBOOTLOADER_UARTPRO_H
#define YMODEMBOOTLOADER_UARTPRO_H
//******************************** Includes *********************************//
#include "main.h"
#include "usart.h"
#include <stdint.h>
#include <string.h>      // 用于strlen函数
#ifdef MYDEBUG
#include "elog.h"
#endif
//******************************** Includes *********************************//
//---------------------------------------------------------------------------//
//******************************** Defines **********************************//
#define UART_DEBUG 1
#define UART_RX_BUF_SIZE     1029
#define UART_HDL   USART1
//******************************** Defines **********************************//
//---------------------------------------------------------------------------//
//******************************** Typedefs *********************************//
/**
 * @brief UART缓冲区状态枚举
 */
typedef enum: uint8_t {
  UART_BUF_IDLE = 0,  // 空闲（可DMA写入或CPU处理）
  UART_BUF_FULL,      // 已满（等待CPU处理）
  UART_BUF_ERROR      // 接收错误（如校验失败）
} uart_buf_state_t;

/**
 * @brief UART单缓冲区描述符结构体
 * 用于描述单个接收缓冲区的状态和数据信息
 */

typedef struct {
  uint8_t *buf;       // 缓冲区指针
  uint16_t len;       // 当前缓冲区内有效数据长度（YMODEM块大小固定，可简化为buf_size）
  uart_buf_state_t state; // 状态（空闲/满/错误）
} uart_buf_t;

/**
 * @brief UART接收控制块结构体
 * 用于管理DMA双缓冲接收机制
 */
typedef struct
{
  uart_buf_t  buf[2];      ///< 双缓冲区描述符数组（buf[0] 和 buf[1] 交替使用）
  uint16_t    buf_size;     ///< 每个缓冲区的总容量（字节），通常等于 UART_RX_BUF_SIZE
  uint8_t     active_idx;   ///< 当前DMA正在写入的目标缓冲区索引 (0 或 1)
  uint8_t     new_data_flag; // 新数据标志（1=有新数据待处理）
} uart_rx_ctrl_t;
//******************************** Typedefs *********************************//
//---------------------------------------------------------------------------//
//**************************** Interface Structs ****************************//
//**************************** Interface Structs ****************************//
//---------------------------------------------------------------------------//
//******************************** Classes **********************************//

//******************************** Classes **********************************//
//---------------------------------------------------------------------------//
//**************************** Extern Variables *****************************//
//**************************** Extern Variables *****************************//
//---------------------------------------------------------------------------//
//******************************** 函数声明 **********************************//
//******************************** 函数声明 **********************************//
#endif //YMODEMBOOTLOADER_UARTPRO_H